---
kind: property
id: P:Autodesk.Revit.UI.Events.DockableFrameFocusChangedEventArgs.PaneId
source: html/3c1fa98d-c080-fc3a-d926-907a1882001d.htm
---
# Autodesk.Revit.UI.Events.DockableFrameFocusChangedEventArgs.PaneId Property

The identifier for dockable pane.

## Syntax (C#)
```csharp
public DockablePaneId PaneId { get; }
```